{
  "Past Continuous": {
    "description": "<b>Past Continuous</b>\n\n<b>1.</b>We form the Past Continuous in this way:\nPOSITIVE\nI/he/she/it      <b>was</b>    <b>waiting.</b>\nYou/we/they  <b>were</b>  <b>waiting.</b>\n\nNEGATIVE\nI/he/she/it       <b>was not/wasn't</b>         <b>waiting.</b>\nYou/we/they   <b>were not/weren't y</b>   <b>waiting.</b>\n\nQUESTIONS\n<b>Was</b>     /he/she/it        <b>waiting?</b>\n<b>Were</b>   you/we/they    <b>waiting?</b>\n\n<b>2.</b> Look at this example:\nI <b>was living</b> in Japan in 1991. (I lived there from 1990 to 1993.)\nWe use the Past Continuous for an action or situation that was in progress at a particular time in the past (e.g. <b>at 7 p.m., in 1991</b>).\n\n<b>3.</b> \nWhen I<b> walked</b> into the room, Ann <b>was writing</b> postcards and Keith <b>was reading</b>.\nWe use the Past Simple (walked) for a completed action. We use the Past Continuous (was writing) for an action in progress in the past.\n\n<b>4.</b>We can use <b>when</b> or <b>while</b> before the Past Continuous:\n I met her when/while we were working for the same company. (when = during the\ntime)\nWe can only use when (not while ) before the Past Simple:\nWhen I met her, we were working for the same company. (when = at the time)"
  },
  "Spelling Rules -er/-est": {
    "description": "Spelling Rules for the Comparative(-er) and Superlative(-est)Forms of Adjectives                \n                \n1.Add -er to one-syllable adjectives to form the comparative.                \nAdd -est to one-syllable adjectives to form the superlative.                \ncheap    cheaper    cheapest\nbright     brighter    brightest\n                \n2.If the adjective ends in -e, add -r or -st.                \nnice        nicer        nicest\n                \n3.If the adjective ends in a consonant +y,change y to i before you add -er or -est.                \npretty        prettier        prettiest\nException:                \nshy        shyer        shyest\n                \n4.If the adjective ends in a consonant-vowel-consonant combination(CVC),double the final consonant before adding -er or -est.                \nCVC                \n↓↓↓                \nbig        bigger        biggest\nHowever,do not double the consonant in words ending in -w or -y.                \nslow        slower        slowest"
  },
  "Spelling Rules -ing": {
    "description": "Spelling Rules for the Present Progressive\n\n1.Add -ing to the base form of the verb.\nread\nstand\n\n2.If a verb ends in a silent -e,drop the final -e and add -ing\nleave\ntake\n\n3. In a one-syllable word,if the last three letters are a consonant-vowel-consonant combination(CVC),double the last consonant before adding -ing.\nCVC\n↓↓↓\nsit\nCVC\n↓↓↓\nrun\nHowever,do not double the last consonant in words that end in w,x,or y\nsew\nfix\nenjoy\n\n4. In words of two or more syllables that end in a CVC,double the last consonant only if the last syllable is stressed.\nadmit\nwhisper\n\n5.If a verb ends in -ie,change the ie to y before adding -ing.\ndie"
  }
}